cask_args appdir: '/Applications'

# Add Repository
tap 'thoughtbot/formulae'

# Packages

## Shell
brew 'fish'

## Git
brew 'git'
brew 'tig'

## Utils
brew 'wget'
brew 'curl'
brew 'tree'
brew 'openssl'
brew 'libyaml'
brew 'fzf'
brew 'fd'
brew 'grc'
brew 'bat'
brew 'z'

## Languages
brew 'chruby'
brew 'ruby-install'

# Casks
cask 'google-chrome'
cask 'iterm2'
cask 'clipy'
