cask_args appdir: '/Applications'

# Add Repository
tap 'homebrew/versions'
tap 'phinze/homebrew-cask'
tap 'homebrew/binary'
tap 'thoughtbot/formulae'

# Packages

## Shell
brew 'zsh'

## Git
brew 'git'
brew 'tig'

## Utils
brew 'rmtrash'
brew 'coreutils'
brew 'wget'
brew 'curl'
brew 'tree'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'tmux'
brew 'ag'
brew 'fasd'
brew 'reattach-to-user-namespace'


## Languages
brew 'chruby'
brew 'ruby-install'

## DevOps
brew 'docker'
brew 'docker-machine'

# Casks
brew 'brew-cask'
cask 'google-chrome'
cask 'iterm2'
cask 'dropbox'
cask 'alfred'
cask 'sublime-text'
cask 'virtualbox'
cask 'vagrant'
cask 'dash'
cask 'flux'
cask 'onepassword'
cask 'p4merge'
cask 'seil'
cask 'spectacle'
