cask_args appdir: '/Applications'

# Add Repository
tap 'thoughtbot/formulae'
tap 'homebrew/cask-fonts'

# Casks
cask 'google-chrome'
cask 'iterm2'
cask 'clipy'
cask 'rectangle'
cask 'font-hack-nerd-font'
cask 'postico'
cask 'font-fira-code'
cask 'sublime-text'
cask 'raycast'

# Packages

## Shell
brew 'zsh'
bew 'fig'

## Git
brew 'git'
brew 'tig'

## Utils
brew 'wget'
brew 'curl'
brew 'tree'
brew 'openssl'
brew 'libyaml'
brew 'fzf'
brew 'fd'
brew 'grc'
brew 'bat'
brew 'coreutils'
brew 'asdf'
brew 'exa'
brew 'ag'

